Tekla Open API Reference for Tekla Structures 2025
Seam.SetInputPolygon Method
 Sets the input polygon of the seam.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetInputPolygon(
	Polygon InputPolygon
)
Public Function SetInputPolygon (
	InputPolygon As Polygon
) As Boolean
Parameters
InputPolygon
Type: Tekla.Structures.Model.Polygon
The input polygon of the seam.
Return Value
Type: Boolean
True on success.
See Also
Reference
Seam Class
Tekla.Structures.Model Namespace